package com.multi.algo.day06.a_etc;


public class A_SlidingWindow {
    /* 슬라이딩 윈도우는 배열이나 문자열 같은 데이터 구조를 일정한 크기의 ＇윈도우＇ 또는 ＇창＇을 이동시켜가며 주어진 문제를 해결하는 기법
     * 이 윈도우는 데이터의 특정 범위를 가리키며, 시작점과 끝점  (투포인터)이 함께 오른쪽으로(또는 필요에 따라 왼쪽으로) 이동하면서 문제의 조건을 만족하는지를 확인 ,
     * 아나그램은 두 문자열이 서로 같은 문자를 동일한 횟수만큼 포함하고 있지만, 순서가 다를 수 있는관계 , adbabda 과 aaabbdd  는 아나그램
     *
     *  즉, 슬라이딩 윈도우는 문제의 해결을 위해 데이터를 순차적으로 탐색하는 방법
     *      윈도우의 시작과 끝을 조절하면서 전체 데이터를 한 번만 훑으면서 문제 해결,
     *      윈도우 = 연속된 부분을 탐색하는 시작점과 끝점의 범위
     *
     *      아나그램(애너그램)은 같은 문자들을 가지고 있지만 순서만 다른 단어
     */

    public static void main(String[] args) {



    }
}
